#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-yJ8GorgyWHTtdCoE

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-gcp9dahm4c-irntllxe14-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_lambda_function.auth: Refreshing state... [id=handler]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-gcp9dahm4c-irntllxe14-ANY]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=nn1sip]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.db has been changed
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      + layers                         = []
      + tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      + function_name = "lambda-db"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.auth will be updated in-place
  ~ resource "aws_lambda_function" "auth" {
        id                             = "handler"
      ~ last_modified                  = "2021-07-02T16:53:00.999+0000" -> (known after apply)
      ~ source_code_hash               = "lTtSQz1pmqDipPqr78dq2Zv7YTsa1IpehLgblsGVS10=" -> "CrIhQG8rx7koy9a+CfQmJ4URm/H+BTsLoM/0WQdA0/U="
        tags                           = {}
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2021-07-02T16:52:30.793+0000" -> (known after apply)
      ~ source_code_hash               = "7LE8yj7yWdmGifQ4htQpd3GqBYBnDaJB3r5MSjhJSos=" -> "ahGuzzcy+UxMpn8dJjJoe6TqM3VHX33tMR68RFTziR4="
      ~ tags                           = {
          + "managed-by" = "terraform"
        }
      ~ tags_all                       = {
          + "managed-by" = "terraform"
        }
      ~ timeout                        = 3 -> 30
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + result_entry = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*